#include <iostream>
#include <string>
int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b, b1, b2, c, c1, c2;
	int dops;
	std::cout << "¬ведите сколько будет стоить подача: \n";
		std::cin >> a;//подача в рубл€х
	
	std::cout << "¬ведите сколько километров поедет такси: \n";
		std::cin >> b;//км в пути

	std::cout << "¬ведите сколько будет включЄнных км в такси: \n";
		std::cin >> b1;//км бесплатных

	std::cout << "¬ведите сколько будет рублей за километр: \n";
		std::cin >> b2;//стоимость 1 км

	std::cout << "¬ведите сколько минут едет такси: \n";
		std::cin >> c;//мин в пути

	std::cout << "¬ведите сколько будет бесплатных мин в такси: \n";
		std::cin >> c1;//мин бесплатных

	std::cout << "¬ведите сколько будет рублей за минуту: \n";
		std::cin >> c2; //стоимость мин в пути
		
	std::cout << "¬ведите суммированные допы которые есть \n";
		std::cin >> dops;
		int d = a + (b - b1) * b2 + (c - c1) * c2 + dops;

		std::cout << "—тоимость в рубл€х."<<d<<" руб\n";
}