//Задание 3. Майские — усложнение
//Программа начинается с понедельника т.к в условии не сказанно что год нужно учитывать
#include <iostream>
int main()
{
	setlocale(LC_ALL, "Russian");

	//1-5, 8-10 выходные

	int inputday;

	int dayplus;

	std::cout << "Введите день мая с которого хотите начать\n";
	std::cin >> inputday;

	std::cout << "Введите сколько дней отсутупить от дня которого вы ввели\n";
	std::cin >> dayplus;


	int b = inputday + dayplus;

	if (b < 1 || b > 31) {

		std::cout << "Нет такого дня мая, попробуй снова указать день с которого хочешь начать\n";

	}
	else if ((b >= 1 && b <= 10) || b % 7 == 6 || b % 7 == 0) {

		std::cout << "Выходной";

	}else {
	
		std::cout << "Не выходной";
		
	}
}